Revit 2024 API
PDFExportOptions.HideScopeBoxes Property
 Whether to hide scope boxes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool HideScopeBoxes { get; set; }
Visual Basic
Public Property HideScopeBoxes As Boolean
	Get
	Set
Visual C++
public:
property bool HideScopeBoxes {
	bool get ();
	void set (bool value);
}
See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace